In [1]:
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine

# Import password authentication for the postgresql database
from config import password

### Connect to local database

In [2]:
# Create Engine and connection
engine = create_engine(f"postgresql://postgres:{password}@localhost:5432/fast_food_census_db")

In [3]:
# Check for tables
engine.table_names()

['zip', 'zip_zcta', 'census', 'restaurant', 'restaurant_address']

### Use pandas to load csv-converted dataframes into database

In [4]:
census_df = pd.read_csv("../02_transform_census/clean_census.csv", dtype={'zcta': 'str'})
census_df.head()

,zcta,population,median_age,median_household_income,per_capita_income,poverty_count,unemployment_count
0,00601,17242.0,40.5,13092.0,6999.0,10772.0,2316.0
1,00602,38442.0,42.3,16358.0,9277.0,19611.0,1927.0
2,00603,48814.0,41.1,16603.0,11307.0,24337.0,3124.0
3,00606,6437.0,43.3,12832.0,5943.0,4163.0,230.0
4,00610,27073.0,42.1,19309.0,10220.0,11724.0,1290.0

In [5]:
census_df.to_sql(name='census', con=engine, if_exists="append", index=False)

In [6]:
zip_code_df = pd.read_csv("../02_transform_restaurant/final_zip_code.csv", dtype='str')
zip_code_df.head()

  zip_code        city state
0    00501  Holtsville    NY
1    00544  Holtsville    NY
2    00601    Adjuntas    PR
3    00602      Aguada    PR
4    00603   Aguadilla    PR

In [7]:
zip_code_df.to_sql(name='zip', con=engine, if_exists="append", index=False)

In [8]:
zcta_df = pd.read_csv("../02_transform_zip_zcta/zcta.csv", dtype='str')
zcta_df.head()

  zip_code   zcta
0    00501  11742
1    00544  11742
2    00601  00601
3    00602  00602
4    00603  00603

In [9]:
zcta_df.to_sql(name="zip_zcta", con=engine, if_exists="append", index=False)

In [10]:
restaurant_df = pd.read_csv("../02_transform_restaurant/restaurant_id.csv")
restaurant_df.head()

   restaurant_id restaurant_name
0              1  SONIC Drive In
1              2       Taco Bell
2              3          Arby's
3              4  Steak 'n Shake
4              5         Wendy's

In [11]:
restaurant_df.to_sql(name='restaurant', con=engine, if_exists="append", index=False)

In [12]:
restaurant_address_df = pd.read_csv("../02_transform_restaurant/restaurant_address.csv", dtype={'zip_code': 'str'})
restaurant_address_df.head()

   restaurant_id street_no   street_name zip_code
0              1       800  N Canal Blvd    70301
1              1       124     John R Rd    48083
2              1       909        N Wood    75644
3              1        97  Gateway Blvd    82901
4              1      6557  S Staples St    78413

In [13]:
restaurant_address_df.to_sql(name='restaurant_address', con=engine, if_exists="append", index=False)

### Confirm data has been added by querying the tables

In [14]:
pd.read_sql_query('SELECT * FROM census', con=engine).head()

,zcta,population,median_age,median_household_income,per_capita_income,poverty_count,unemployment_count
0,00601,17242.0,40.5,13092.0,6999.0,10772.0,2316.0
1,00602,38442.0,42.3,16358.0,9277.0,19611.0,1927.0
2,00603,48814.0,41.1,16603.0,11307.0,24337.0,3124.0
3,00606,6437.0,43.3,12832.0,5943.0,4163.0,230.0
4,00610,27073.0,42.1,19309.0,10220.0,11724.0,1290.0

In [15]:
pd.read_sql_query('SELECT * FROM zip_zcta', con=engine).head()

  zip_code   zcta
0    00501  11742
1    00544  11742
2    00601  00601
3    00602  00602
4    00603  00603

In [16]:
pd.read_sql_query('SELECT * FROM zip', con=engine).head()

  zip_code        city state
0    00501  Holtsville    NY
1    00544  Holtsville    NY
2    00601    Adjuntas    PR
3    00602      Aguada    PR
4    00603   Aguadilla    PR

In [17]:
pd.read_sql_query('SELECT * FROM restaurant_address', con=engine).head()

   restaurant_address_id  restaurant_id street_no   street_name zip_code
0                      1              1       800  N Canal Blvd    70301
1                      2              1       124     John R Rd    48083
2                      3              1       909        N Wood    75644
3                      4              1        97  Gateway Blvd    82901
4                      5              1      6557  S Staples St    78413

In [18]:
pd.read_sql_query('SELECT * FROM restaurant', con=engine).head()

   restaurant_id restaurant_name
0              1  SONIC Drive In
1              2       Taco Bell
2              3          Arby's
3              4  Steak 'n Shake
4              5         Wendy's

#### What zip_code has the most number of fastfood restaurant?